src/Documents/Поступление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Поступление</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.СписаниеДенежныхСредств</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключениеСтоимостиУслугВСебестоимостьЗапасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налогообложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Налогообложение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>Статья расходов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплачено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Comment>Документ основания</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Comment>Ключ строки, связь с документом основания</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Comment>Статья расходов</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснования</Name>
							<Comment>Документ основания</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Comment>Ключ строки, связь с документом основания</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запас</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Имущество</Name>
					<Comment>Имущество организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыОтветственныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОтветственныхЛиц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кладовщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Поступление/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс	
	
// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура УстановитьНачальныеДанныеДокумента(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеЗапасовЗапасы.Ссылка КАК Документ,
	|	ПоступлениеЗапасовЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеЗапасовЗапасы.Ссылка.Склад КАК Склад,
	|	ПоступлениеЗапасовЗапасы.Ссылка.Дата КАК Период,
	|	ПоступлениеЗапасовЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеЗапасовЗапасы.Ссылка.ВидЦен КАК ВидЦен,
	|	ПоступлениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ПоступлениеЗапасовЗапасы.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ПоступлениеЗапасовЗапасы.Цена КАК Цена,
	|	ПоступлениеЗапасовЗапасы.Упаковка КАК Упаковка,
	|	ПоступлениеЗапасовЗапасы.Количество КАК Количество,
	|	ПоступлениеЗапасовЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеЗапасовЗапасы.Всего КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеЗапасовЗапасы.Ссылка.АвторДокумента КАК Автор
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.Поступление.Запасы КАК ПоступлениеЗапасовЗапасы
	|ГДЕ
	|	ПоступлениеЗапасовЗапасы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеРасходы.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеРасходы.Ссылка КАК Документ,
	|	ПоступлениеРасходы.Ссылка.Контрагент КАК Контрагент,
	|	ПоступлениеРасходы.Ссылка.Склад КАК Склад,
	|	ПоступлениеРасходы.Ссылка.Дата КАК Период,
	|	ПоступлениеРасходы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеРасходы.Ссылка.ВидЦен КАК ВидЦен,
	|	ПоступлениеРасходы.Номенклатура КАК Номенклатура,
	|	ПоступлениеРасходы.Цена КАК Цена,
	|	ПоступлениеРасходы.Упаковка КАК Упаковка,
	|	ПоступлениеРасходы.Количество КАК Количество,
	|	ПоступлениеРасходы.СтавкаНДС КАК СтавкаНДС,
	|	ПоступлениеРасходы.Всего КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеРасходы.Ссылка.АвторДокумента КАК Автор
	|ПОМЕСТИТЬ ВременнаяТаблицаРасходы
	|ИЗ
	|	Документ.Поступление.Расходы КАК ПоступлениеРасходы
	|ГДЕ
	|	ПоступлениеРасходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.НомерСтроки КАК НомерСтроки,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка КАК Документ,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.Организация
	|	КОНЕЦ КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.Дата КАК Период,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Сумма КАК Сумма,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Номенклатура КАК Номенклатура,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Цена КАК Цена,
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыКонтрагентов
	|ИЗ
	|	Документ.Поступление.Запасы КАК ПоступлениеЗапасовВзаморасчетыКонрагентов
	|ГДЕ
	|	ПоступлениеЗапасовВзаморасчетыКонрагентов.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходыВзаморасчетыКонрагентов.НомерСтроки,
	|	РасходыВзаморасчетыКонрагентов.Ссылка,
	|	РасходыВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница,
	|	РасходыВзаморасчетыКонрагентов.Ссылка.Контрагент,
	|	ВЫБОР
	|		КОГДА РасходыВзаморасчетыКонрагентов.Ссылка.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяССылка)
	|			ТОГДА РасходыВзаморасчетыКонрагентов.Ссылка.СтруктурнаяЕдиница.Организация
	|		ИНАЧЕ РасходыВзаморасчетыКонрагентов.Ссылка.Организация
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	РасходыВзаморасчетыКонрагентов.Ссылка.Дата,
	|	РасходыВзаморасчетыКонрагентов.Сумма,
	|	РасходыВзаморасчетыКонрагентов.Номенклатура,
	|	РасходыВзаморасчетыКонрагентов.Цена,
	|	РасходыВзаморасчетыКонрагентов.Ссылка.Договор
	|ИЗ
	|	Документ.Поступление.Расходы КАК РасходыВзаморасчетыКонрагентов
	|ГДЕ
	|	РасходыВзаморасчетыКонрагентов.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Затраты.Период КАК Период,
	|	Затраты.Сотрудник КАК Сотрудник,
	|	Затраты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	Затраты.Контрагент КАК Контрагент,
	|	Затраты.Номенклатура КАК Номенклатура,
	|	Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	|	СУММА(Затраты.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВременнаяТаблицаЗатрат
	|ИЗ
	|	(ВЫБРАТЬ
	|		Затраты.Дата КАК Период,
	|		ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
	|		Затраты.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		Затраты.Ссылка.Контрагент КАК Контрагент,
	|		NULL КАК Номенклатура,
	|		Затраты.СтатьяЗатрат КАК СтатьяЗатрат,
	|		Затраты.Сумма КАК Сумма
	|	ИЗ
	|		Документ.Поступление.Затраты КАК Затраты
	|	ГДЕ
	|		Затраты.Ссылка = &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПоступлениеРасходы.Ссылка.Дата,
	|		ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка),
	|		ПоступлениеРасходы.Ссылка.СтруктурнаяЕдиница,
	|		ПоступлениеРасходы.Ссылка.Контрагент,
	|		ПоступлениеРасходы.Номенклатура,
	|		ПоступлениеРасходы.СтатьяРасходов,
	|		ПоступлениеРасходы.Всего
	|	ИЗ
	|		Документ.Поступление.Расходы КАК ПоступлениеРасходы
	|	ГДЕ
	|		ПоступлениеРасходы.Ссылка = &Ссылка
	|		И ПоступлениеРасходы.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)) КАК Затраты
	|
	|СГРУППИРОВАТЬ ПО
	|	Затраты.СтруктурнаяЕдиница,
	|	Затраты.Сотрудник,
	|	Затраты.СтатьяЗатрат,
	|	Затраты.Контрагент,
	|	Затраты.Период,
	|	Затраты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ПоступлениеЗапасы.НомерСтроки) КАК НомерСтроки,
	|	ПоступлениеЗапасы.Ссылка.Дата КАК Период,
	|	ПоступлениеЗапасы.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ПоступлениеЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Имущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы)
	|	КОНЕЦ КАК СчетДт,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики) КАК СчетКт,
	|	ПоступлениеЗапасы.Номенклатура КАК СубконтоДт1,
	|	ПоступлениеЗапасы.Ссылка.Склад КАК СубконтоДт2,
	|	NULL КАК СубконтоДт3,
	|	NULL КАК СубконтоДт4,
	|	ПоступлениеЗапасы.Ссылка.Контрагент КАК СубконтоКт1,
	|	СУММА(ПоступлениеЗапасы.Сумма) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ПоступлениеЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
	|					ИЛИ ПоступлениеЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал)
	|				ТОГДА ПоступлениеЗапасы.Количество
	|		КОНЕЦ) КАК Количество,
	|	""Поступление от поставщика(запасы)"" КАК Содержание
	|ПОМЕСТИТЬ ВременнаяТаблицаУправленческий
	|ИЗ
	|	Документ.Поступление.Запасы КАК ПоступлениеЗапасы
	|ГДЕ
	|	ПоступлениеЗапасы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеЗапасы.Ссылка.Дата,
	|	ПоступлениеЗапасы.Ссылка.СтруктурнаяЕдиница,
	|	ПоступлениеЗапасы.Номенклатура,
	|	ПоступлениеЗапасы.Ссылка.Контрагент,
	|	ПоступлениеЗапасы.Ссылка.Склад,
	|	ВЫБОР
	|		КОГДА ПоступлениеЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Имущество)
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Имущество)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Запасы)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходыРасходыПрочие.НомерСтроки,
	|	РасходыРасходыПрочие.Ссылка.Дата,
	|	РасходыРасходыПрочие.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыПрочие),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики),
	|	РасходыРасходыПрочие.СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА РасходыРасходыПрочие.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)
	|			ТОГДА РасходыРасходыПрочие.Специализация
	|		ИНАЧЕ РасходыРасходыПрочие.Номенклатура.Специализация
	|	КОНЕЦ,
	|	NULL,
	|	NULL,
	|	РасходыРасходыПрочие.Ссылка.Контрагент,
	|	СУММА(РасходыРасходыПрочие.Сумма),
	|	NULL,
	|	""Поступление от поставщика(услуги)""
	|ИЗ
	|	Документ.Поступление.Расходы КАК РасходыРасходыПрочие
	|ГДЕ
	|	РасходыРасходыПрочие.Ссылка = &Ссылка
	|	И РасходыРасходыПрочие.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И (НЕ РасходыРасходыПрочие.ДокументОснования ССЫЛКА Документ.НарядЗаказ
	|			ИЛИ РасходыРасходыПрочие.ДокументОснования = ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходыРасходыПрочие.Ссылка.Дата,
	|	РасходыРасходыПрочие.Ссылка.СтруктурнаяЕдиница,
	|	РасходыРасходыПрочие.СтатьяРасходов,
	|	РасходыРасходыПрочие.Ссылка.Контрагент,
	|	РасходыРасходыПрочие.НомерСтроки,
	|	ВЫБОР
	|		КОГДА РасходыРасходыПрочие.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяСсылка)
	|			ТОГДА РасходыРасходыПрочие.Специализация
	|		ИНАЧЕ РасходыРасходыПрочие.Номенклатура.Специализация
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходыРасходыРаспределенные.НомерСтроки,
	|	РасходыРасходыРаспределенные.Ссылка.Дата,
	|	РасходыРасходыРаспределенные.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыРаспределенные),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики),
	|	ВЫБОР
	|		КОГДА РасходыРасходыРаспределенные.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяССылка)
	|			ТОГДА РасходыРасходыРаспределенные.Специализация
	|		ИНАЧЕ РасходыРасходыРаспределенные.Номенклатура.Специализация
	|	КОНЕЦ,
	|	РасходыРасходыРаспределенные.Сотрудник,
	|	ВЫБОР
	|		КОГДА РасходыРасходыРаспределенные.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА РасходыРасходыРаспределенные.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Лаборатория)
	|	КОНЕЦ,
	|	NULL,
	|	РасходыРасходыРаспределенные.Ссылка.Контрагент,
	|	СУММА(РасходыРасходыРаспределенные.Сумма),
	|	NULL,
	|	""Поступление от поставщика(услуги)""
	|ИЗ
	|	Документ.Поступление.Расходы КАК РасходыРасходыРаспределенные
	|ГДЕ
	|	РасходыРасходыРаспределенные.Ссылка = &Ссылка
	|	И РасходыРасходыРаспределенные.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И (НЕ РасходыРасходыРаспределенные.ДокументОснования ССЫЛКА Документ.НарядЗаказ
	|			ИЛИ РасходыРасходыРаспределенные.ДокументОснования = ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходыРасходыРаспределенные.Ссылка.Дата,
	|	РасходыРасходыРаспределенные.Ссылка.СтруктурнаяЕдиница,
	|	РасходыРасходыРаспределенные.Ссылка.Контрагент,
	|	РасходыРасходыРаспределенные.НомерСтроки,
	|	РасходыРасходыРаспределенные.Сотрудник,
	|	ВЫБОР
	|		КОГДА РасходыРасходыРаспределенные.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяССылка)
	|			ТОГДА РасходыРасходыРаспределенные.Специализация
	|		ИНАЧЕ РасходыРасходыРаспределенные.Номенклатура.Специализация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасходыРасходыРаспределенные.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА РасходыРасходыРаспределенные.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Лаборатория)
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходыРасходыСебестоимость.НомерСтроки,
	|	РасходыРасходыСебестоимость.Ссылка.Дата,
	|	РасходыРасходыСебестоимость.Ссылка.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.РасходыСебестоимость),
	|	ЗНАЧЕНИЕ(ПланСчетов.Управленческий.Поставщики),
	|	ВЫБОР
	|		КОГДА РасходыРасходыСебестоимость.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяССылка)
	|			ТОГДА РасходыРасходыСебестоимость.Специализация
	|		ИНАЧЕ РасходыРасходыСебестоимость.Номенклатура.Специализация
	|	КОНЕЦ,
	|	РасходыРасходыСебестоимость.ДокументОснования.Контрагент,
	|	РасходыРасходыСебестоимость.Сотрудник,
	|	ВЫБОР
	|		КОГДА РасходыРасходыСебестоимость.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА РасходыРасходыСебестоимость.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Лаборатория)
	|	КОНЕЦ,
	|	РасходыРасходыСебестоимость.Ссылка.Контрагент,
	|	СУММА(РасходыРасходыСебестоимость.Сумма),
	|	NULL,
	|	""Поступление от поставщика(услуги)""
	|ИЗ
	|	Документ.Поступление.Расходы КАК РасходыРасходыСебестоимость
	|ГДЕ
	|	РасходыРасходыСебестоимость.Ссылка = &Ссылка
	|	И РасходыРасходыСебестоимость.ДокументОснования ССЫЛКА Документ.НарядЗаказ
	|	И РасходыРасходыСебестоимость.ДокументОснования <> ЗНАЧЕНИЕ(Документ.НарядЗаказ.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасходыРасходыСебестоимость.Ссылка.Дата,
	|	РасходыРасходыСебестоимость.Ссылка.СтруктурнаяЕдиница,
	|	РасходыРасходыСебестоимость.Ссылка.Контрагент,
	|	РасходыРасходыСебестоимость.НомерСтроки,
	|	РасходыРасходыСебестоимость.Сотрудник,
	|	РасходыРасходыСебестоимость.ДокументОснования.Контрагент,
	|	ВЫБОР
	|		КОГДА РасходыРасходыСебестоимость.Специализация <> ЗНАЧЕНИЕ(Справочник.Специализации.ПустаяССылка)
	|			ТОГДА РасходыРасходыСебестоимость.Специализация
	|		ИНАЧЕ РасходыРасходыСебестоимость.Номенклатура.Специализация
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РасходыРасходыСебестоимость.СтатьяРасходов <> ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.ПустаяСсылка)
	|			ТОГДА РасходыРасходыСебестоимость.СтатьяРасходов
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Лаборатория)
	|	КОНЕЦ";
	
	
	Запрос.УстановитьПараметр("Ссылка"            , ДокументСсылкаПриходнаяНакладная);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	Запрос.ВыполнитьПакет();
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПартииТоваров(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУстановкаЦен(ДокументСсылкаПриходнаяНакладная, СтруктураДополнительныеСвойства);	
	СформироватьТаблицаЗатраты(СтруктураДополнительныеСвойства);	
	СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства);	
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПоступлениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаЗапасыНаСкладах.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаЗапасыНаСкладах.Период КАК Период,
	|	ТаблицаЗапасыНаСкладах.Склад КАК Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура КАК Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия КАК Партия,
	|	СУММА(ТаблицаЗапасыНаСкладах.Количество) КАК Количество
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаЗапасыНаСкладах
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗапасыНаСкладах.Период,
	|	ТаблицаЗапасыНаСкладах.Склад,
	|	ТаблицаЗапасыНаСкладах.СтруктурнаяЕдиница,
	|	ТаблицаЗапасыНаСкладах.Номенклатура,
	|	ТаблицаЗапасыНаСкладах.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗапасыНаСкладах", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаЗапасыНаСкладах()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаВзаиморасчетыСКонтрагентами(ДокументСсылкаПоступлениеЗапасов, СтруктураДополнительныеСвойства)
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаВзаиморасчетыСКонтрагентами.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период КАК Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент КАК Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация КАК Организация,
	|	СУММА(ТаблицаВзаиморасчетыСКонтрагентами.Сумма) КАК Сумма,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор КАК Договор
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыКонтрагентов КАК ТаблицаВзаиморасчетыСКонтрагентами
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаВзаиморасчетыСКонтрагентами.Период,
	|	ТаблицаВзаиморасчетыСКонтрагентами.СтруктурнаяЕдиница,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Контрагент,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Организация,
	|	ТаблицаВзаиморасчетыСКонтрагентами.Договор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетыСКонтрагентами", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры	

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПартииТоваров(ДокументСсылкаПоступлениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ТаблицаПартииТоваров.НомерСтроки) КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаПартииТоваров.Период КАК Период,
	|	ТаблицаПартииТоваров.Документ КАК ДокументПоступления,
	|	ТаблицаПартииТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаПартииТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаПартииТоваров.Склад КАК Склад,
	|	СУММА(ТаблицаПартииТоваров.Количество) КАК Количество,
	|	СУММА(ТаблицаПартииТоваров.Сумма) КАК Стоимость,
	|	ТаблицаПартииТоваров.Партия
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаПартииТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаПартииТоваров.Период,
	|	ТаблицаПартииТоваров.Документ,
	|	ТаблицаПартииТоваров.СтруктурнаяЕдиница,
	|	ТаблицаПартииТоваров.Номенклатура,
	|	ТаблицаПартииТоваров.Склад,
	|	ТаблицаПартииТоваров.Партия";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПартииТоваров", РезультатЗапроса.Выгрузить());		

КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУстановкаЦен(ДокументСсылкаПоступлениеЗапасов, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаУстановкаЦен.Период КАК Период,
	|	ТаблицаУстановкаЦен.Номенклатура КАК Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.ВидЦен КАК ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка КАК Упаковка,
	|	ТаблицаУстановкаЦен.Цена КАК Цена,
	|	ТаблицаУстановкаЦен.Автор КАК Автор,
	|	ИСТИНА КАК Актуальность
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаУстановкаЦен
	|ГДЕ
	|	ТаблицаУстановкаЦен.Цена <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУстановкаЦен.Период,
	|	ТаблицаУстановкаЦен.Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка,
	|	ТаблицаУстановкаЦен.Цена,
	|	ТаблицаУстановкаЦен.Автор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаУстановкаЦен.Период,
	|	ТаблицаУстановкаЦен.Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка,
	|	ТаблицаУстановкаЦен.Цена,
	|	ТаблицаУстановкаЦен.Автор,
	|	ИСТИНА
	|ИЗ
	|	ВременнаяТаблицаРасходы КАК ТаблицаУстановкаЦен
	|ГДЕ
	|	ТаблицаУстановкаЦен.Цена <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаУстановкаЦен.Период,
	|	ТаблицаУстановкаЦен.Номенклатура,
	|	ТаблицаУстановкаЦен.СтруктурнаяЕдиница,
	|	ТаблицаУстановкаЦен.ВидЦен,
	|	ТаблицаУстановкаЦен.Упаковка,
	|	ТаблицаУстановкаЦен.Цена,
	|	ТаблицаУстановкаЦен.Автор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановкаЦен", РезультатЗапроса.Выгрузить());		

КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаЗатраты(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	Затраты.Период,
	|	Затраты.СтруктурнаяЕдиница,
	|	Затраты.СтатьяЗатрат,
	|	Затраты.Сотрудник,
	|	Затраты.Контрагент,
	|	Затраты.Номенклатура,
	|	Затраты.Сумма
	|ИЗ
	|	ВременнаяТаблицаЗатрат КАК Затраты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗатраты", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВременнаяТаблицаУправленческий.НомерСтроки КАК НомерСтроки,
	|	ВременнаяТаблицаУправленческий.Период,
	|	ВременнаяТаблицаУправленческий.СтруктурнаяЕдиница,
	|	ВременнаяТаблицаУправленческий.СчетДт,
	|	ВременнаяТаблицаУправленческий.СчетКт,
	|	ВременнаяТаблицаУправленческий.СубконтоДт1,
	|	ВременнаяТаблицаУправленческий.СубконтоДт2,
	|	ВременнаяТаблицаУправленческий.СубконтоДт3,
	|	ВременнаяТаблицаУправленческий.СубконтоДт4,
	|	ВременнаяТаблицаУправленческий.СубконтоКт1,
	|	ВременнаяТаблицаУправленческий.Сумма,
	|	ВременнаяТаблицаУправленческий.Количество,
	|	ВременнаяТаблицаУправленческий.Содержание КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаУправленческий КАК ВременнаяТаблицаУправленческий
	|
	|УПОРЯДОЧИТЬ ПО
	|	Содержание,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

 // Функция формирует печатную форму Накладная документа.
//
Функция СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати)
	
	Запрос = Новый Запрос("ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	                      |	Поступление.Ссылка КАК Ссылка,
	                      |	Поступление.Номер КАК Номер,
	                      |	Поступление.Дата КАК Дата,
	                      |	Поступление.СтруктурнаяЕдиница.Организация КАК Организация,
	                      |	Поступление.СтруктурнаяЕдиница.Организация.Префикс КАК Префикс,
	                      |	Поступление.ВидЦен.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	                      |	Поступление.Контрагент КАК Поставщик,
	                      |	Поступление.СтруктурнаяЕдиница.Организация.БанковскийСчетПоУмолчанию.ВалютаДенежныхСредств КАК Валюта
	                      |ИЗ
	                      |	Документ.Поступление КАК Поступление
	                      |ГДЕ
	                      |	Поступление.Ссылка В(&МассивДокументов)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВложенныйЗапрос.Ссылка КАК Ссылка,
	                      |	ВложенныйЗапрос.Номенклатура,
	                      |	ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК ТоварНаименованиеПолное,
	                      |	ВложенныйЗапрос.Номенклатура.Код,
	                      |	ВложенныйЗапрос.СтавкаНДС,
	                      |	ВложенныйЗапрос.Цена,
	                      |	ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                      |	ВложенныйЗапрос.Упаковка КАК Упаковка,
	                      |	ВложенныйЗапрос.КоличествоУпаковок КАК Количество,
	                      |	ВЫБОР
	                      |		КОГДА ВложенныйЗапрос.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	                      |			ТОГДА ВложенныйЗапрос.Номенклатура.ЕдиницаИзмерения.Наименование
	                      |		ИНАЧЕ ВложенныйЗапрос.Упаковка.Наименование
	                      |	КОНЕЦ КАК ЕдиницаЦены,
	                      |	ВложенныйЗапрос.Сумма,
	                      |	ВложенныйЗапрос.СуммаНДС,
	                      |	ВложенныйЗапрос.НомерСтроки,
	                      |	ЛОЖЬ КАК ЭтоВозвратнаяТара,
	                      |	ВЫБОР
	                      |		КОГДА ВложенныйЗапрос.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ВложенныйЗапрос.Упаковка.Коэффициент
	                      |	КОНЕЦ КАК Коэффициент,
	                      |	ВложенныйЗапрос.Упаковка.Коэффициент,
	                      |	ВложенныйЗапрос.Номенклатура.Артикул,
	                      |	ВложенныйЗапрос.Партия
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Поступление.Ссылка КАК Ссылка,
	                      |		ПоступлениеЗапасы.Номенклатура КАК Номенклатура,
	                      |		ПоступлениеЗапасы.СтавкаНДС КАК СтавкаНДС,
	                      |		ПоступлениеЗапасы.Цена КАК Цена,
	                      |		ПоступлениеЗапасы.КоличествоУпаковок КАК КоличествоУпаковок,
	                      |		ПоступлениеЗапасы.Сумма КАК Сумма,
	                      |		ПоступлениеЗапасы.СуммаНДС КАК СуммаНДС,
	                      |		ПоступлениеЗапасы.НомерСтроки КАК НомерСтроки,
	                      |		ПоступлениеЗапасы.Упаковка КАК Упаковка,
	                      |		ПоступлениеЗапасы.Партия КАК Партия
	                      |	ИЗ
	                      |		Документ.Поступление.Запасы КАК ПоступлениеЗапасы
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поступление КАК Поступление
	                      |			ПО ПоступлениеЗапасы.Ссылка = Поступление.Ссылка
	                      |	ГДЕ
	                      |		Поступление.Ссылка В(&МассивДокументов)) КАК ВложенныйЗапрос
	                      |ИТОГИ ПО
	                      |	Ссылка");
		
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПоступлениеТоваровУслуг_Накладная";
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	МассивРезультатов   = Запрос.ВыполнитьПакет();
	ДанныеПечати        = МассивРезультатов[0].Выбрать();
	ВыборкаПоДокументам = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	ДопКолонка = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДополнительнаяКолонкаПечатныхФормДокументов");
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	Пока ДанныеПечати.Следующий() Цикл
	
		// Найдем в выборке товары по текущему документу
		СтруктураПоиска = Новый Структура("Ссылка", ДанныеПечати.Ссылка);
		НайденСледующий = ВыборкаПоДокументам.НайтиСледующий(СтруктураПоиска);
		
		// Если в накладной только услуги - перейдем к следующему документу
		
		Если НайденСледующий Тогда
			ВыборкаПоТоварам = ВыборкаПоДокументам.Выбрать();
	
			ВыборкаПоТоварам.Сбросить();
		Иначе
			Продолжить;
		КонецЕсли;
		
		// Макет необходимо получать для каждого документа, т.к. размеры колонок изменяются динамически
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.Поступление.ПФ_MXL_Накладная");
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Выводим шапку накладной
		
		ОбластьНомера  = Макет.ПолучитьОбласть("Заголовок|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("Заголовок|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("Заголовок|Товар");
		ОбластьДанных  = Макет.ПолучитьОбласть("Заголовок|Данные");
		
		ТекстЗаголовка = НСтр("ru='Приходная накладная № %НомерДокумента% от %ДатаДокумента% г.'");
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%НомерДокумента%", ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(ДанныеПечати.Номер, ДанныеПечати.Префикс));
		ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%ДатаДокумента%",  Формат(ДанныеПечати.Дата, "ДФ='дд ММММ гггг'"));
		
		ОбластьНомера.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
			
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Поставщик");
		ПредставлениеПоставщика                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Поставщик, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ПредставлениеПоставщика;
		ОбластьМакета.Параметры.Поставщик               = ДанныеПечати.Поставщик;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета                                   = Макет.ПолучитьОбласть("Покупатель");
		ПредставлениеПолучателя                         = ФормированиеПечатныхФорм.ОписаниеОрганизации(ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Организация, ДанныеПечати.Дата), "ПолноеНаименование");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = ПредставлениеПолучателя;
		ОбластьМакета.Параметры.Получатель              = ДанныеПечати.Организация;
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим заголовок таблицы Товары

		ОбластьКолонкаТовар = Макет.Область("Товар");
			
		ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТовар.ШиринаКолонки * 1.2;
		ОбластьНомера  = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("ШапкаТаблицы|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("ШапкаТаблицы|Товар");
		ОбластьДанных  = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
			
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ОбластьНомера  = Макет.ПолучитьОбласть("СтрокаТаблицы1|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("СтрокаТаблицы1|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("СтрокаТаблицы1|Товар");
		ОбластьДанных  = Макет.ПолучитьОбласть("СтрокаТаблицы1|Данные");
		
		Сумма          = 0;
		СуммаНДС       = 0;
		НомерСтроки    = 0;
		
		// Выводим строки таблицы Товары
			
		Пока ВыборкаПоТоварам.Следующий() Цикл
			
			НомерСтроки = НомерСтроки + 1;
			
			ОбластьНомера.Параметры.НомерСтроки = НомерСтроки;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаПоТоварам.НоменклатураАртикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаПоТоварам.НоменклатураКод;
				КонецЕсли;
				ТабличныйДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			
			ОбластьТовар.Параметры.Заполнить(ВыборкаПоТоварам);
			ОбластьТовар.Параметры.Товар = ФормированиеПечатныхФорм.ПолучитьПредставлениеНоменклатурыДляПечати(ВыборкаПоТоварам.ТоварНаименованиеПолное, Неопределено)
				+ ?(ВыборкаПоТоварам.ЭтоВозвратнаяТара, НСтр("ru=' (возвратная тара)'"), "");
				
			ТабличныйДокумент.Присоединить(ОбластьТовар);

			ОбластьДанных.Параметры.Заполнить(ВыборкаПоТоварам);
			
			Если НЕ ВыборкаПоТоварам.Упаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка() Тогда
				
				ОбластьДанных.Параметры.ЕдиницаЦены = ОбластьДанных.Параметры.ЕдиницаЦены + "("+ВыборкаПоТоварам.Коэффициент+")";
				
			КонецЕсли;

			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			Сумма          = Сумма          + ВыборкаПоТоварам.Сумма;
			СуммаНДС       = СуммаНДС       + ВыборкаПоТоварам.СуммаНДС;
			
		КонецЦикла;
		
		// Выводим подвал
		
	
		ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицы|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицы|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицы|Товар");
		ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицы|Данные");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		
		ОбластьДанных.Параметры.Всего = ФормированиеПечатныхФорм.ФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		// Выводим ИтогоНДС

		ОбластьНомера  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Товар");
		ОбластьДанных  = Макет.ПолучитьОбласть("ПодвалТаблицыНДС|Данные");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
			
		ТабличныйДокумент.Присоединить(ОбластьТовар);
			
		ОбластьДанных.Параметры.ВсегоНДС = ФормированиеПечатныхФорм.ФорматСумм(СуммаНДС);
		ОбластьДанных.Параметры.НДС = ?(ДанныеПечати.ЦенаВключаетНДС, НСтр("ru='В том числе НДС:'"), НСтр("ru='Сумма НДС:'"));
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		// Выводим Сумму прописью
		
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(ДанныеПечати.ЦенаВключаетНДС, 0, СуммаНДС);
		
		ИтоговаяСтрока = НСтр("ru='Всего наименований %КоличествоНаименований%, на сумму %СуммаДокумента% '");
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%КоличествоНаименований%", ВыборкаПоТоварам.Количество());
		ИтоговаяСтрока = СтрЗаменить(ИтоговаяСтрока, "%СуммаДокумента%", ФормированиеПечатныхФорм.СуммаРубКоп(СуммаКПрописи, ,));// ФормированиеПечатныхФорм.ФорматСумм(СуммаКПрописи, ДанныеПечати.Валюта));

		ОбластьМакета.Параметры.ИтоговаяСтрока = ИтоговаяСтрока;
		ОбластьМакета.Параметры.СуммаПрописью  = ФормированиеПечатныхФорм.СформироватьСуммуПрописью(СуммаКПрописи, ДанныеПечати.Валюта);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Выводим подписи
		ОбластьНомера  = Макет.ПолучитьОбласть("ПодписиЛиния|НомерСтроки");
		ОбластьКодов   = Макет.ПолучитьОбласть("ПодписиЛиния|КолонкаКодов");
		ОбластьТовар   = Макет.ПолучитьОбласть("ПодписиЛиния|Товар");
		ОбластьДанных  = Макет.ПолучитьОбласть("ПодписиЛиния|Данные");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабличныйДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабличныйДокумент.Присоединить(ОбластьТовар);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		Кладовщик=ОбщегоНазначенияСтоматология.ПолучитьСрезПоследнихПоОтветсвеннымЛицам(ДанныеПечати.Организация,Перечисления.ТипыОтветственныхЛиц.Кладовщик,ДанныеПечати.Дата);
		Если Кладовщик.Количество()>0 Тогда 
			  ОбластьМакета.Параметры.ПолучениеПроизвел=ФормированиеПечатныхФорм.ФамилияИнициалыФизЛица(Строка(Кладовщик[0].Сотрудник));
		КонецЕсли;	
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;

КонецФункции // СформироватьПечатнуюФормуНакладная()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Приходная накладная", СформироватьПечатнуюФормуНакладная(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры // Печать()

////////////////////////////////////// ПРОЧИЕ ПРОЦЕДУРЫ И ФУНКЦИИ//////////////////////////////////////

// Функция вернет документ поступления созданный на основании указанного док заказа
Функция ПолучитьДокПоступленияПоДокЗаказа(ЗаказПоставщику) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ПоступлениеЗапасы.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Поступление.Запасы КАК ПоступлениеЗапасы
	|ГДЕ
	|	ПоступлениеЗапасы.ДокументОснования = &ДокументОснование
	|	И ПоступлениеЗапасы.Ссылка.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеЗапасы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка УБЫВ";
	Запрос.УстановитьПараметр("ДокументОснование",ЗаказПоставщику);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),Выборка.Ссылка,Неопределено);
	
КонецФункции

// Заполнить объект поступления на основании заполнения
Процедура ЗаполнитьДокПоступлениеИзОснования(Докобъект, Основание) Экспорт	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Докобъект.Склад      	      = Основание.Склад;
		Докобъект.Контрагент 	      = Основание.Контрагент;
		Докобъект.СтруктурнаяЕдиница  = Основание.СтруктурнаяЕдиница;
		Докобъект.СуммаОплачено       = Основание.СуммаОплачено;
		Докобъект.ДокументОснование	  = Основание;

		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПоставщику.Номенклатура,
		|	ЗаказПоставщику.Партия,
		|	ЗаказПоставщику.Количество,
		|	ЗаказПоставщику.Цена,
		|	ЗаказПоставщику.Сумма,
		|	ЗаказПоставщику.СтавкаНДС,
		|	ЗаказПоставщику.СуммаНДС,
		|	ЗаказПоставщику.Всего,
		|	ЗаказПоставщику.Упаковка,
		|	ЗаказПоставщику.КоличествоУпаковок,
		|	ЗаказПоставщику.Ссылка КАК ДокументОснования
		|ИЗ
		|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &ДокументОснование";
		Запрос.УстановитьПараметр("ДокументОснование", Основание);	
		Докобъект.Запасы.Загрузить(Запрос.Выполнить().Выгрузить());	
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.НарядЗаказ") Тогда				
		Докобъект.Склад      			= Основание.Склад;		
		Докобъект.СтруктурнаяЕдиница 	= Основание.СтруктурнаяЕдиница;
		Докобъект.ВидЦен       		    = Основание.ВидЦен;
		Докобъект.Контрагент   		    = Основание.Лаборатория;
		
		Запрос       = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказЗапасы.Ссылка КАК ДокументОснования,
		|	НарядЗаказЗапасы.Количество,
		|	НарядЗаказЗапасы.КоличествоУпаковок,
		|	НарядЗаказЗапасы.Номенклатура,
		|	НарядЗаказЗапасы.Партия,
		|	НарядЗаказЗапасы.Сумма,
		|	НарядЗаказЗапасы.Упаковка,
		|	НарядЗаказЗапасы.Цена,
		|	НарядЗаказЗапасы.Всего,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНдс) КАК СтавкаНДС
		|ИЗ
		|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		|ГДЕ
		|	НарядЗаказЗапасы.Ссылка = &ДокументОснование
		|	И (НарядЗаказЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|			ИЛИ НарядЗаказЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Материал))
		|	И НарядЗаказЗапасы.Лаборатория = &Лаборатория
		|	И ВЫБОР
		|			КОГДА &Фильтр
		|				ТОГДА НарядЗаказЗапасы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.выполнено)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НарядЗаказЗапасы.Ссылка КАК ДокументОснования,
		|	НарядЗаказЗапасы.Количество,
		|	НарядЗаказЗапасы.КоличествоУпаковок,
		|	НарядЗаказЗапасы.Номенклатура,
		|	НарядЗаказЗапасы.Партия,
		|	НарядЗаказЗапасы.Сумма,
		|	НарядЗаказЗапасы.Упаковка,
		|	НарядЗаказЗапасы.Цена,
		|	НарядЗаказЗапасы.Всего,
		|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНдс) КАК СтавкаНДС,
		|	НарядЗаказЗапасы.Ссылка.Сотрудник,
		|	СотрудникиСпецилазацииСотрудника.Специализация,
		|	ЗНАЧЕНИЕ(Справочник.СтатьиДоходовИРасходов.Лаборатория) КАК СтатьяРасходов
		|ИЗ
		|	Документ.НарядЗаказ.Запасы КАК НарядЗаказЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.СпецилазацииСотрудника КАК СотрудникиСпецилазацииСотрудника
		|		ПО НарядЗаказЗапасы.Ссылка.Сотрудник = СотрудникиСпецилазацииСотрудника.Ссылка
		|			И (СотрудникиСпецилазацииСотрудника.Основная = ИСТИНА)
		|ГДЕ
		|	НарядЗаказЗапасы.Ссылка = &ДокументОснование
		|	И НарядЗаказЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И НарядЗаказЗапасы.Лаборатория = &Лаборатория
		|	И ВЫБОР
		|			КОГДА &Фильтр
		|				ТОГДА НарядЗаказЗапасы.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыНарядЗаказа.выполнено)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";           
		
		Запрос.УстановитьПараметр("ДокументОснование", Основание);		
		Запрос.УстановитьПараметр("Лаборатория"      , Основание.Лаборатория);
		Запрос.УстановитьПараметр("Фильтр"           , Ложь);
		Результат = Запрос.ВыполнитьПакет();
		Докобъект.Запасы.Загрузить(Результат[0].Выгрузить());
		Докобъект.Расходы.Загрузить(Результат[1].Выгрузить());
	КонецЕсли;
КонецПроцедуры

#Область ЗагрузкаДанныхИзВнешнегоИсточника

Процедура ПоляЗагрузкиДанныхИзВнешнегоИсточника(ТаблицаПолейЗагрузки, НастройкиЗагрузкиДанных) Экспорт
	
	//
	// Для группы полей действует правило: хотя бы одно поле в группе должно быть выбрано в колонках
	//
	
	ПолноеИмяОбъектаЗаполнения = НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;
	
	ОписаниеТиповСтрока25 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(25));
	ОписаниеТиповСтрока30 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(30));
	ОписаниеТиповСтрока50 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(50));
	ОписаниеТиповСтрока100 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(100));
	ОписаниеТиповСтрока150 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(150));
	ОписаниеТиповСтрока200 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(200));
	ОписаниеТиповСтрока1000 = Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(1000));
	ОписаниеТиповЧисло15_2 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный));
	ОписаниеТиповЧисло15_3 = Новый ОписаниеТипов("Число", , , , Новый КвалификаторыЧисла(15, 3, ДопустимыйЗнак.Неотрицательный));
	
	ЭтоЗапасы = (ПолноеИмяОбъектаЗаполнения = "Документ.Поступление.ТабличнаяЧасть.Запасы");
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Родитель", "Группа", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, , , , );
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Код", "Код", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 1, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Штрихкод", "Штрихкод", ОписаниеТиповСтрока200, ОписаниеТиповКолонка, "Номенклатура", 2, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Артикул", "Артикул", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 3, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименование","Номенклатура (наименование)", ОписаниеТиповСтрока100, ОписаниеТиповКолонка, "Номенклатура", 4, , Истина);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "НоменклатураНаименованиеПолное","Номенклатура (полное наименование)", ОписаниеТиповСтрока1000, ОписаниеТиповКолонка, "Номенклатура", 5, , Истина);
	// ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "КодСинхронизации", "Код синхронизации", ОписаниеТиповСтрока25, ОписаниеТиповКолонка, "Номенклатура", 6,,Истина);
	
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Партия", "Партия (наименование)", ОписаниеТиповСтрока150, ОписаниеТиповКолонка);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Количество", "Количество", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_3, , , Истина);	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Цена", "Цена", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2, , ,);	
		
	ОписаниеТиповКолонка = Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры");
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПоУмолчанию", "Упаковка поступления", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "УпаковкаПродажи", "Упаковка продажи", ОписаниеТиповСтрока25, ОписаниеТиповКолонка);
	
	ЗагрузкаДанныхИзВнешнегоИсточника.ДобавитьПолеОписанияЗагрузки(ТаблицаПолейЗагрузки, "Коэффициент", "Коэффициент упаковки", ОписаниеТиповСтрока25, ОписаниеТиповЧисло15_2);

КонецПроцедуры

Процедура ПриОпределенииОбразцовЗагрузкиДанных(НастройкиЗагрузкиДанных, УникальныйИдентификатор) Экспорт
	
	Образец_xlsx = ПолучитьМакет("ОбразецЗагрузкиДанных_xlsx");
	ОбразецЗагрузкиДанных_xlsx = ПоместитьВоВременноеХранилище(Образец_xlsx, УникальныйИдентификатор);
	НастройкиЗагрузкиДанных.Вставить("ОбразецЗагрузкиДанных_xlsx", ОбразецЗагрузкиДанных_xlsx);
	
КонецПроцедуры

Процедура СопоставитьЗагружаемыеДанныеИзВнешнегоИсточника(ПараметрыСопоставления, АдресРезультата) Экспорт
	
	НастройкиОбновленияСвойств  = ПараметрыСопоставления.НастройкиЗагрузкиДанных.НастройкиОбновленияСвойств;
	ТаблицаСопоставленияДанных	= ПараметрыСопоставления.ТаблицаСопоставленияДанных;
	РазмерТаблицыДанных			= ТаблицаСопоставленияДанных.Количество();
	НастройкиЗагрузкиДанных		= ПараметрыСопоставления.НастройкиЗагрузкиДанных;
	ПолноеИмяОбъектаЗаполнения 	= НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения;

	// ТаблицаСопоставленияДанных - Тип ДанныеФормыКоллекция
	Для каждого СтрокаТаблицыФормы Из ТаблицаСопоставленияДанных Цикл
		
		// Номенклатура по ШтрихКоду, Артикулу, Наименованию, НаименованиеПолное, Код, КодСинхронизации
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьНоменклатуру(СтрокаТаблицыФормы.Номенклатура, 
			СтрокаТаблицыФормы.Штрихкод, 
			СтрокаТаблицыФормы.Артикул, 
			СтрокаТаблицыФормы.НоменклатураНаименование, 
			СтрокаТаблицыФормы.НоменклатураНаименованиеПолное, 
			СтрокаТаблицыФормы.Код);
		ЭтаСтрокаСопоставлена = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура);
		
		// Родитель по наименованию
		ЗначениеПоУмолчанию = Справочники.Номенклатура.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьРодителя("Номенклатура", СтрокаТаблицыФормы.Родитель, СтрокаТаблицыФормы.Родитель_ВходящиеДанные, ЗначениеПоУмолчанию);
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель)
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.Родитель_ВходящиеДанные) Тогда
			
			ГруппаНоменклатуры = Справочники.Номенклатура.СоздатьГруппу();
			ГруппаНоменклатуры.Наименование = СтрокаТаблицыФормы.Родитель_ВходящиеДанные;
			ГруппаНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;
			ГруппаНоменклатуры.Записать();
			СтрокаТаблицыФормы.Родитель = ГруппаНоменклатуры.Ссылка;
			
		КонецЕсли;
		
		// Упаковк по умолчанию
		ЗначениеПоУмолчанию = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПоУмолчанию, СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура, ЗначениеПоУмолчанию);
		
		// УпаковкаПродажи
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьУпаковку(СтрокаТаблицыФормы.УпаковкаПродажи, СтрокаТаблицыФормы.УпаковкаПродажи_ВходящиеДанные, СтрокаТаблицыФормы.Номенклатура, ЗначениеПоУмолчанию);
		
		// Коэффициент
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Коэффициент, СтрокаТаблицыФормы.Коэффициент_ВходящиеДанные, 1);
		
		Если НЕ ЭтаСтрокаСопоставлена
			И ЗначениеЗаполнено(СтрокаТаблицыФормы.НоменклатураНаименование) Тогда
						
			ЭлементСправочника = Справочники.Номенклатура.СоздатьЭлемент();	
			ЭлементСправочника.Заполнить(Новый Структура("Родитель", СтрокаТаблицыФормы.Родитель));
			ЗаполнитьЗначенияСвойств(ЭлементСправочника, СтрокаТаблицыФормы, , ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СтандартныеИменаПолейНеподлежащихОбновлению(ПараметрыСопоставления.НастройкиЗагрузкиДанных));
			// ЭлементСправочника.Записать();
				
			ЭлементСправочника.Наименование = СтрокаТаблицыФормы.НоменклатураНаименование;
			ЭлементСправочника.НаименованиеПолное = ?(ПустаяСтрока(СтрокаТаблицыФормы.НоменклатураНаименованиеПолное), СтрокаТаблицыФормы.НоменклатураНаименование, СтрокаТаблицыФормы.НоменклатураНаименованиеПолное);
			ЭлементСправочника.ЭтоУслуга = ?(ЭлементСправочника.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга, Истина, Ложь);
			ЭлементСправочника.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
						
			ЭлементСправочника.Записать();

			СтрокаТаблицыФормы.Номенклатура = ЭлементСправочника.Ссылка;
			
		КонецЕсли;
		
		СоздатьУпаковкуПоУмолчанию 	= Не ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию) И ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные);			
		СоздатьУпаковкуПродажи 		= Не ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПродажи) И ЗначениеЗаполнено(СтрокаТаблицыФормы.УпаковкаПродажи_ВходящиеДанные);
		
		Если СоздатьУпаковкуПоУмолчанию
			ИЛИ СоздатьУпаковкуПродажи Тогда
			
			ЭлементСправочника = СтрокаТаблицыФормы.Номенклатура.Ссылка.ПолучитьОбъект();
			
			Если СоздатьУпаковкуПоУмолчанию Тогда
				
				// Создать упаковку по умолчанию
				НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
				НоваяУпаковка.Наименование = СтрокаТаблицыФормы.УпаковкаПоУмолчанию_ВходящиеДанные;
				НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
				НоваяУпаковка.Записать();
				
				ЭлементСправочника.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
				СтрокаТаблицыФормы.УпаковкаПоУмолчанию = НоваяУпаковка.Ссылка;
				
			КонецЕсли;
			
			Если СоздатьУпаковкуПродажи Тогда
				
				Если НЕ ЗначениеЗаполнено(ЭлементСправочника.УпаковкаПоУмолчанию) Тогда
					
					// Создать упаковку продажи
					НоваяУпаковка = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
					НоваяУпаковка.Владелец     = ЭлементСправочника.Ссылка;
					НоваяУпаковка.Наименование = СтрокаТаблицыФормы.УпаковкаПродажи_ВходящиеДанные;
					НоваяУпаковка.Коэффициент  = СтрокаТаблицыФормы.Коэффициент;
					НоваяУпаковка.Записать();
					
					ЭлементСправочника.УпаковкаПродажи = НоваяУпаковка.Ссылка;
					СтрокаТаблицыФормы.УпаковкаПродажи = НоваяУпаковка.Ссылка;
				Иначе
					
					ЭлементСправочника.УпаковкаПродажи = ЭлементСправочника.УпаковкаПоУмолчанию;
					СтрокаТаблицыФормы.УпаковкаПродажи = ЭлементСправочника.УпаковкаПоУмолчанию;
					
				КонецЕсли;
				
			КонецЕсли;
			
			ЭлементСправочника.Записать();
			
		КонецЕсли;
		
		Если ПолноеИмяОбъектаЗаполнения = "Документ.Поступление.ТабличнаяЧасть.Расходы" Тогда
			
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				
				СтрокаТаблицыФормы.Номенклатура = Неопределено;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПолноеИмяОбъектаЗаполнения = "Документ.Поступление.ТабличнаяЧасть.Запасы" Тогда
			
			Если СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал Тогда
				
				СтрокаТаблицыФормы.Номенклатура = Неопределено;
				
			КонецЕсли;
			
			//// Партия по Владельцу и Наименованию
			// ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.СопоставитьПартию(СтрокаТаблицыФормы.Партия, СтрокаТаблицыФормы.Номенклатура, СтрокаТаблицыФормы.Штрихкод, СтрокаТаблицыФормы.Партия_ВходящиеДанные);
						
			// ХарактеристикаСсылка = Справочники.ПартииНоменклатуры.ПустаяСсылка();
			Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура) Тогда
				
				СсылкаНомеклатуры = СтрокаТаблицыФормы.Номенклатура.Ссылка;
				Если ЗначениеЗаполнено(СтрокаТаблицыФормы.Партия_ВходящиеДанные) Тогда
					
					НомеклатураОбъект = СсылкаНомеклатуры.ПолучитьОбъект();
					Если НомеклатураОбъект.ИспользоватьПартии = Ложь Тогда
						НомеклатураОбъект.ИспользоватьПартии = Истина;
						НомеклатураОбъект.Записать();
					КонецЕсли;
					
					НоваяХарактеристика = Справочники.ПартииНоменклатуры.Выбрать(, СсылкаНомеклатуры, Новый Структура("Наименование", СтрокаТаблицыФормы.Партия_ВходящиеДанные));
					Если НоваяХарактеристика.Следующий() Тогда
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					Иначе
						НоваяХарактеристика              = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
						НоваяХарактеристика.Владелец     = СсылкаНомеклатуры;
						НоваяХарактеристика.Наименование = СтрокаТаблицыФормы.Партия_ВходящиеДанные;
						НоваяХарактеристика.Записать();
						СтрокаТаблицыФормы.Партия = НоваяХарактеристика.Ссылка;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
	
		КонецЕсли;
								
		// Количество
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Количество, СтрокаТаблицыФормы.Количество_ВходящиеДанные, 1);
		
		// Цена
		ЗагрузкаДанныхИзВнешнегоИсточникаПереопределяемый.ПреобразоватьСтрокуВЧисло(СтрокаТаблицыФормы.Цена, СтрокаТаблицыФормы.Цена_ВходящиеДанные, 0);
		
		ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения);
		
		ЗагрузкаДанныхИзВнешнегоИсточника.ПрогрессСопоставленияДанных(ТаблицаСопоставленияДанных.Индекс(СтрокаТаблицыФормы), РазмерТаблицыДанных);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ТаблицаСопоставленияДанных, АдресРезультата);
	
КонецПроцедуры

Процедура ПроверитьКорректностьДанныхВСтрокеТаблицы(СтрокаТаблицыФормы, ПолноеИмяОбъектаЗаполнения = "") Экспорт
	
	ИмяСлужебногоПоля = ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна();
	
	Если ПолноеИмяОбъектаЗаполнения = "Документ.Поступление.ТабличнаяЧасть.Запасы" Тогда
		
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
			И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас ИЛИ СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Материал
			И СтрокаТаблицыФормы.Количество <> 0;
			
	ИначеЕсли ПолноеИмяОбъектаЗаполнения = "Документ.Поступление.ТабличнаяЧасть.Расходы" Тогда
			
		СтрокаТаблицыФормы[ИмяСлужебногоПоля] = ЗначениеЗаполнено(СтрокаТаблицыФормы.Номенклатура)
			И СтрокаТаблицыФормы.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
			И СтрокаТаблицыФормы.Количество <> 0;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
